{"inkVersion":20,"root":[[{"->t->":"PLOT.intro"},"ev","str","^Head toward the den","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Approach the stove","/str","/ev",{"*":"0.c-1","flg":20},"ev","str","^Make snacks","/str","/ev",{"*":"0.c-2","flg":20},"ev","str","^Start cooking","/str","/ev",{"*":"0.c-3","flg":20},"ev","str","^Eat dinner","/str","/ev",{"*":"0.c-4","flg":20},{"c-0":["\n",{"->t->":"Den"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->t->":"Den.light_flame"},{"->":"0.g-0"},{"#f":5}],"c-2":["\n",{"->t->":"Den.make_snacks"},{"->":"0.g-0"},{"#f":5}],"c-3":["\n",{"->t->":"Den.cook_dinner"},{"->":"0.g-0"},{"#f":5}],"c-4":["\n",{"->t->":"Den.eat_dinner"},"end",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"PLOT":[{"->":".^.intro"},{"intro":[{"#":"CHAPTER 1"},"^Perched on the cliffs of a rocky coast, a grove of cypress and pine watches over the northwest sea.","\n","^Moonlight trickles through its white tipped tree tops, glittering from the icy roof of a stout cottage within.","\n","^The snow that buries the foot of its cedar walls is bathed in an ochre glow. Behind frosty glass, a young girl holds a light over a woman entombed in a pile of knit orange pillows.","\n","^\"Madame--you're burning up!\" says ","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^.","\n","^\"I'll be okay, darling.\" Madame ","ev",{"VAR?":"WITCH_NAME"},"out","/ev","^ soothes.","\n","^She takes her student's hand from her brow, and ","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ holds her tightly as she sits up.","\n","^Her gaze falls to a black timepiece on a stack of worn books to her left. She gently settles it into the inner pocket of her robes.","\n","^\"There's a lot of work that needs to be done for dinner tonight,\" she sighed, rising to her feet.","\n","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ bites her lip. \"Maybe you should take it easy. I don't want you to faint again.\"","\n","^Madame ","ev",{"VAR?":"WITCH_NAME"},"out","/ev","^ stifles a cough. \"The winter solstice only comes once a year,\" she replied. \"I wouldn't miss it for the world.\"","\n","^\"And besides,\" she squeezes ","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^'s hand. \"With you around, what do I have to fear?\"","\n","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ beams. \"I'll pour us some tea!\"","\n","ev","void","/ev","->->",{"#f":1}],"#f":1}],"Den":[{"#":"CLEAR"},{"->t->":".^.on_enter"},"ev","void","/ev","->->",{"on_first_enter":["^In the den lived a black iron stove. It nestles in the western wall of the airy room.","\n","ev","void","/ev","->->",{"#f":1}],"on_enter":["ev",{"CNT?":"Den.on_first_enter"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->t->":"Den.on_first_enter"},{"->":".^.^.^.5"},null]}],"nop","\n","^An olive green sofa, an armchair covered in blankets, and a low wooden table huddle around the hearth's glow.","\n","^Embers cast smoldering shadows on the room beyond the furniture.","\n","ev","void","/ev","->->",{"#f":1}],"light_flame":[["ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ crept toward the stove, holding her fire aloft.","\n","^Dormant candles awaken as she passes by and return to darkness as she recedes.","\n","^At the sound of her footsteps, the stove brightens. Its hatch opens eagerly.","\n","ev","str","^Feed the stove","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ serves her flame and closes the hatch.","\n","^Its fire roars, and she is submerged in a wave of soft light.","\n","^Candles twinkle from every corner of the room.","\n","ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"make_snacks":[{"#":"CLEAR"},"ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ releases a flow of cool water from the barrel's spigot. The iron kettle is filled to its brim, and it is placed on the stovetop.","\n","^She withdraws a little blue pot from the cupboard above her and uncorks it with a 'pop'.","\n","^The dried black herbs within fill the air with the fragrance of earth and spice.","\n","^She had picked up this tea a few days ago at the market while shopping for supplies.","\n","^In her absence, some guests had arrived at the cottage. Madame worked herself to the bone to see to their needs.","\n","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ had found her collapsed in the kitchen after they left.","\n","^\"I should've been there,\" she muttered.","\n","^The whistle of the kettle snaps her to attention.","\n","^She","\n","^[Set plate of cookies, dried fruit, jerky]","\n","^[Take to ","ev",{"VAR?":"WITCH_NAME"},"out","/ev","^]","\n","ev","void","/ev","->->",{"#f":1}],"cook_dinner":[{"#":"CLEAR"},"^[Chop up onions, garlic]","\n","^[Sear some meat]","\n","^[Deglaze fond, saute aromatics]","\n","^[Replace meat, pour in stock, bring to a simmer]","\n","^[Cover]","\n","^...","\n","^\"I'm going to talk with our guest tonight. I'll be right as rain after that.\"","\n","^...","\n","^The visitors did not stay long. Madame saw to that.","\n","^It was fortunate that she was able to convince one of them to stay.","\n","^...","\n","^\"Now remember,\" she continued. \"How long do the mushrooms simmer in the stock?\"","\n","^\"Between 6 to 12 hours,\" ","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ recited. \"The longer, the better.\"","\n","^The lady smiles.","\n","^...","\n","ev","void","/ev","->->",{"#f":1}],"eat_dinner":[{"#":"CLEAR"},"ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ cradled a candle as she stepped into the darkness.","\n","^From the depths of the room, a slight rustle could be heard.","\n","^She feels her way to the table and lights the lone candelabra on its surface.","\n","^It shed its dim light on a small cabinet on her left, a stack of wooden barrels on her right, and a figure sitting across the table.","\n","^Muffled moans escape from the black cloth wrapped around his head.","\n","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^ hums. She rummages through the cabinet and pulls out two plates and a handful of silver forks and knives.","\n","^As she arranges them on the table, an enormous enamel pot descends the stairs, followed by Madame ","ev",{"VAR?":"WITCH_NAME"},"out","/ev","^.","\n","^The woman sets the pot next to the candelabra. \"Oh good. Our guest is awake.\"","\n","^The figure writhes at the sound of her voice.","\n","^The ropes that hold his limbs to his chair strain, but give no slack.","\n","^She tears the cloth from his face.","\n","^...","\n","^[Seat the diners]","\n","^\"I'll ask you one last time,\" she crooned. \"How did you find this place?\"","\n","^\"Fuck you,\" he spat. \"My order will return. They're not going to let a monster like you live--\"","\n","^She thrusts the dagger into his stomach and unleashes a torrent of thick, inky smoke.","\n","^\"\"","\n","^The man is swallowed in acrid shadows, drowning in his own gurgling screams.","\n","^A sickening emerald light flows from the dagger. It travels along the length of her arm and inside her open mouth.","\n","^She savors its taste. It was invigorating--intoxicating--and she knew no other flavor that gave her life the way this light did.","\n","^The dust settles on a silent room.","\n","^[Serve the food, eat]","\n","^\"","ev",{"VAR?":"APPRENTICE_NAME"},"out","/ev","^, I hope you were paying attention,\" said the woman. \"Next winter, I'll be teaching you how to do it yourself.\"","\n","ev","void","/ev","->->",{"#f":1}],"#f":1}],"global decl":["ev","str","^Alice","/str",{"VAR=":"APPRENTICE_NAME"},"str","^Rochelle","/str",{"VAR=":"WITCH_NAME"},"/ev","end",null],"#f":1}],"listDefs":{}}